MDK-Packs/CB_Lab4Layer/project/Platform/LPCXpresso55S69/RTE/Board_Support/LPC55S69JBD100_cm33_core0/pin_mux.h
/*! @name PIO1_21 (number 30), P17[3]/P24[6]/FC4_I2C_SDA_ARD
  @{ */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO1_20 (number 4), P17[1]/P24[5]/FC4_I2C_SCL_ARD
  @{ */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO1_19 (number 58), U7[3]/P18[14]/PLU_OUT1/GPIO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITACCELPINS_ACCL_INTR_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_27_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_27_FUNC_ALT1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_24_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO1_24_FUNC_ALT1 0x01u

/*! @name PIO0_27 (number 27), P18[13]/P24[4]/FC2_USART_TXD_ARD
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_TX_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_TX_PIN 27U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_TX_PIN_MASK (1U << 27U)
/* @} */

/*! @name PIO1_24 (number 3), P18[15]/P18[10]/P24[3]/PLU_OUT6/GPIO/FC2_USART_RXD_ARD/SD1_D1
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_RX_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_RX_PIN 24U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_RX_PIN_MASK (1U << 24U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features for USART on 
 * Arduino UNO R3 connectors.
 *
 */
void BOARD_InitPins_Arduino_USART2(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_26_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO0_26_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_1_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_1_FUNC_ALT0 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_1_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_2_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 6. */
#define PIO1_2_FUNC_ALT6 0x06u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_2_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_3_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 6. */
#define PIO1_3_FUNC_ALT6 0x06u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_3_SLEW_FAST 0x01u

/*! @name PIO1_2 (number 61), P17[9]/P23[4]/LSPI_HS_SCK
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SCK_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SCK_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SCK_PIN_MASK (1U << 2U)
/* @} */

/*! @name PIO1_3 (number 62), P17[11]/P23[5]/LSPI_HS_MISO
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MISO_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MISO_PIN 3U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MISO_PIN_MASK (1U << 3U)
/* @} */

/*! @name PIO0_26 (number 60), P17[13]/P23[6]/LSPI_HS_MOSI
  @{ */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MOSI_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MOSI_PIN 26U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MOSI_PIN_MASK (1U << 26U)
/* @} */

/*! @name PIO1_1 (number 59), P17[15]/P23[3]/LSPI_HS_SSEL1
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SSN_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SSN_GPIO_PIN_MASK (1U << 1U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SSN_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SSN_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SSN_PIN_MASK (1U << 1U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features for SPI on 
 * Arduino UNO R3 connectors.
 *
 */
void BOARD_InitPins_Arduino_SPI8(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define PIO1_5_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_5_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO1_5 (number 31), P17[17]/P24[1]/PIO1_5_GPIO_ARD
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_PIO1_5_ARDUINO_PIO1_5_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITPINS_ARDUINO_PIO1_5_ARDUINO_PIO1_5_GPIO_PIN_MASK (1U << 5U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_PIO1_5_ARDUINO_PIO1_5_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_ARDUINO_PIO1_5_ARDUINO_PIO1_5_PIN 5U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_ARDUINO_PIO1_5_ARDUINO_PIO1_5_PIN_MASK (1U << 5U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features for PIO1_5 pin on 
 * Arduino UNO R3 connectors.
 *
 */
void BOARD_InitPins_Arduino_PIO1_5(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
